module sk.common.reflect {
   //============================================================
   // <T>描述类。</T>
   //
   // @property
   // @param name:String 名称
   // @author maocy
   // @version 150104
   //============================================================
   export class AAnnotation {
      // @attribute
      _clazz = null;
      // @attribute
      _annotationCd = null;
      _inherit = false;
      _duplicate = false;
      _ordered = false;
      // @attribute
      _name = null;
      
      //..........................................................
      constructor(name) {
         this._name = name;
      }

      //============================================================
      // <T>获得关联类对象。</T>
      //
      // @method
      // @return TClass 关联类对
      //============================================================
      public clazz() {
         return this._clazz;
      }

      //============================================================
      // <T>获得描述类型。</T>
      //
      // @method
      // @return EAnnotation 描述类型
      //============================================================
      public annotationCd() {
         return this._annotationCd;
      }

      //============================================================
      // <T>判断是否允许继承。</T>
      //
      // @method
      // @return boolean 是否允许继承
      //============================================================
      public isInherit() {
         return this._inherit;
      }

      //============================================================
      // <T>判断是否允许重复。</T>
      //
      // @method
      // @return boolean 是否允许重复
      //============================================================
      public isDuplicate() {
         return this._duplicate;
      }

      //============================================================
      // <T>判断是否允许有序。</T>
      //
      // @method
      // @return boolean 是否允许有序
      //============================================================
      public isOrdered() {
         return this._ordered;
      }

      //============================================================
      // <T>获得名称。</T>
      //
      // @method
      // @return String 代码
      //============================================================
      public name() {
         return this._name;
      }

      //============================================================
      // <T>获得代码。</T>
      //
      // @method
      // @return String 代码
      //============================================================
      public code() {
         return this._name;
      }

      //==========================================================
      // <T>获得内容。</T>
      //
      // @method
      // @return Object 内容
      //==========================================================
      public value() {
         return null;
      }
   }
}